{"_id":{"$oid":"6815ce4963590134be674b2d"},"title":"Pahalgam Terror Attack LIVE Updates: Pakistan military conducts training launch of surface-to-surface missile with 450km range","content":"n the wake of the attack, the government has intensified security and diplomatic measures. The National Investigation Agency (NIA) has taken over the probe, dispatching teams to Anantnag to gather evidence and identify suspects. Union Home Secretary Govind Mohan chaired a meeting with top security agencies to review the situation.\n\nIndia has suspended the Indus Waters Treaty with Pakistan and ordered all Pakistani nationals without diplomatic or long-term visas to leave by April 29. The Home Ministry has instructed states to strictly enforce the directive.\n\nMeanwhile, ceasefire violations by Pakistan continued for a fifth consecutive night, extending to the Akhnoor sector. Indian forces have stepped up counter-terror operations across Kashmir, with J&K police conducting raids and demolishing nine properties linked to militants.\n\nPM Modi vowed to bring the perpetrators to justice, while an all-party meeting affirmed political consensus for a strong response to cross-border terrorism.","category":"Indo-Pak Tension","date":{"$date":"2025-05-03T08:05:29.718Z"},"author":"Div","excerpt":"Pahalgam Terror Attack Live Updates: With expectations mounting for a retaliatory strike after the Pahalgam terror attack that killed 26 people, Prime Minister Narendra Modi has reportedly given the armed forces full operational freedom to decide the timing, targets, and method of response against Pakistan. In a high-level meeting with defence minister Rajnath Singh, NSA Ajit Doval, Chief of Defence Staff Gen. Anil Chauhan, and the service chiefs, Modi expressed confidence in the military’s capabilities and pledged complete political backing for any necessary action.\n","isBreaking":false,"__v":0,"image":"https://static.toiimg.com/thumb/imgsize-17350,msid-120807195,width-400,resizemode-4/120807195.jpg"}
{"_id":{"$oid":"6815d1fc63590134be674b9d"},"title":"From Chepauk to Eden Gardens: Does home advantage even exist in the IPL?","content":"NEW DELHI: No matter the sport, the\nconcept and idea of home advantage\nmakes a difference to a team. There is\na sense and reasonable argument\nbehind the idea: the home team\nunderstands the conditions,\nunderstands the surface, has vehement\nfan support and these factors can make\na difference between winning and\nlosing.","category":"Sports","date":{"$date":"2025-05-03T08:21:16.869Z"},"author":"Div","excerpt":"While home advantage is significant in many sports, its impact in the IPL is debatable.\nFactors like familiarity and crowd support are often nullified by diverse team\ncompositions. Despite strong home records of teams like CSK and MI, recent seasons\nshow a decline in home wins, sparking debate about pitch conditions and the extent of\nhome advantage in the league.","isBreaking":false,"__v":0}
{"_id":{"$oid":"6815cb5c63590134be674ad7"},"title":"Pahalgam Terror Attack LIVE Updates: India bans direct, indirect imports from Pakistan","content":"In the wake of the attack, the government has intensified security and diplomatic measures. The National Investigation Agency (NIA) has taken over the probe, dispatching teams to Anantnag to gather evidence and identify suspects. Union Home Secretary Govind Mohan chaired a meeting with top security agencies to review the situation.\r\n\r\nIndia has suspended the Indus Waters Treaty with Pakistan and ordered all Pakistani nationals without diplomatic or long-term visas to leave by April 29. The Home Ministry has instructed states to strictly enforce the directive.\r\n\r\nMeanwhile, ceasefire violations by Pakistan continued for a fifth consecutive night, extending to the Akhnoor sector. Indian forces have stepped up counter-terror operations across Kashmir, with J&K police conducting raids and demolishing nine properties linked to militants.\r\n\r\nPM Modi vowed to bring the perpetrators to justice, while an all-party meeting affirmed political consensus for a strong response to cross-border terrorism.","category":"Politics","date":{"$date":"2025-05-03T07:53:00.959Z"},"author":"Div","image":"https://static.toiimg.com/thumb/imgsize-953489,msid-120807195,width-400,resizemode-4/120807195.jpg","excerpt":"Pahalgam Terror Attack Live Updates: With expectations mounting for a retaliatory strike after the Pahalgam terror attack that killed 26 people, Prime Minister Narendra Modi has reportedly given the armed forces full operational freedom to decide the timing, targets, and method of response against Pakistan. In a high-level meeting with defence minister Rajnath Singh, NSA Ajit Doval, Chief of Defence Staff Gen. Anil Chauhan, and the service chiefs, Modi expressed confidence in the military’s capabilities and pledged complete political backing for any necessary action.","isBreaking":false,"__v":0}
{"_id":{"$oid":"6815d49b63590134be674bea"},"title":"Zomato 'quietly ends' the food delivery service it started just 4 months back","content":"Quick, accessible via Zomato's explore page, offered ready-to-eat meals from\nselect restaurants within a two-kilometer radius but is no longer visible. Zomato\nreportedly did not respond to Money Control queries on the same. Incidentally,\nZomato CFO Akshant Goyal previously suggested the feature's limited impact,\nstating, \"All these initiatives (10-minute delivery in India) are still at a very early\nstage and are not likely to move the needle,\" during the Q3FY24 results\nannouncement. Quick reportedly accounted for 8% of Zomato's order volume\naround March.\nThis marks Zomato's second failed attempt at quick deliveries. Its 2022 venture,\nZomato Instant, promised 10-minute deliveries in Bengaluru and Delhi-NCR but\nshut down by January 2023. It was succeeded by Zomato Everyday, which has\nalso vanished from the app.\nZomato has now pivoted to Bistro by Blinkit, a separate service leveraging Blinkit's\ndark stores to deliver snacks and small meals quickly. Swiggy countered with its\nSnacc app. However, Zomato CEO Deepinder Goyal admitted to Money Control last\nOctober that scaling quick deliveries is challenging due to difficulties in securing\nrestaurant partners. He noted, \"Zomato Instant was not the right product market\nfit. Zomato Everyday...has a slightly better model,\" with plans to include simple\nitems like samosas and puffs.","category":"Business","date":{"$date":"2025-05-03T08:32:27.597Z"},"author":"Div","excerpt":"Zomato has quietly removed its 15-minute food delivery service, Quick, from its app after\njust four months, hinting at a change in its rapid delivery strategy. This follows the\nshutdown of Zomato Instant in 2023. The company is now focusing on Bistro by Blinkit\nfor quick snack deliveries amid increasing competition, separating it from the main\nrestaurant delivery service.","isBreaking":false,"__v":0}
{"_id":{"$oid":"6815db4963590134be674cd2"},"title":"Ads, album art and more: 5 simple ways to use GPT-40-powered ChatGPT image generation tool","content":"dfhkfa","category":"Technology","date":{"$date":"2025-05-03T09:00:57.505Z"},"author":"Div","excerpt":"hek","isBreaking":false,"__v":0}
{"_id":{"$oid":"6815cfbb63590134be674b6c"},"title":"Pope Trump! U.S. President posts AI-generated image of himself dressed as pope","content":"U.S. President Donald Trump posted on Friday (May 2, 2025) a spoof picture of himself dressed as the pope on his Truth Social platform after joking that he would like to be the next Catholic pontiff.\n\nThe president is seen in what appears to be an AI-generated color image, with his right index finger pointed toward the sky, wearing papal regalia, including white robes, a gold crucifix pendant and the miter hat.\n\nPope Francis | 1936-2025\n\nIt comes after Mr. Trump joked to reporters this week that he would like to be the next pope, just days before cardinals are due to start the conclave to elect the successor of Pope Francis who died on April 21.\n\n\nAsked who he would like to succeed Pope Francis, Mr. Trump said: “I’d like to be pope, that would be my number one choice.”\n\nCardinal in New York ‘very good’: Trump\nMr. Trump went on to say that he did not have a preference but said there was a cardinal in New York who was “very good.”\n\nHe appeared to be referring to the archbishop of New York, Timothy Dolan, a theological conservative and fiercely opposed to abortion.\n\nFile picture of Donald Trump at the funeral of Pope Francis in St. Peter’s Square on April 26, 2025 in Vatican City,\nFile picture of Donald Trump at the funeral of Pope Francis in St. Peter’s Square on April 26, 2025 in Vatican City, | Photo Credit: Getty Images\n\nMr. Trump attended the funeral service of Pope Francis last week, his first foreign trip since returning to power.\n\n What will determine the Papal Conclave? | Explained\n\nAbout 20% of Americans declare themselves Catholic, and exit polls indicated in November that they voted around 60% in favor of Mr. Trump.\n\nTrump vs Francis\nPope Francis had arguably been one of the most powerful moral voices on the world stage critical of Mr. Trump.\n\nWhen Mr. Trump first ran for president in 2016, Francis was unsparing on his signature promise to build a border wall to seal off Mexico.\n\nFrancis told reporters, “Anyone, whoever he is, who only wants to build walls and not bridges is not a Christian.”\n\nCardinals will gather on May 7 in a conclave in the Vatican’s Sistine Chapel to elect a new pope.","category":"World","date":{"$date":"2025-05-03T08:11:39.08Z"},"author":"Div","excerpt":"Donald Trump had joked to reporters that he would like to be the next pope, just days before cardinals are due to start the conclave to elect the successor of Pope Francis","isBreaking":false,"__v":0,"image":"https://th-i.thgim.com/public/news/national/jyjvlw/article69533472.ece/alternates/FREE_1200/trump%20pope%20ai.jpeg"}
{"_id":{"$oid":"6815d72463590134be674c5a"},"title":"Google CEO Sun ar PIC al ma es an 'App e announcement' under oath, tells court: Tim Cook was trving to","content":"Department of Justice lawyer Veronica Onyema asked about pla ..\n\nRead more at:\nhttp://timesofindia.indiatimes.com/articleshow/120772417.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst","category":"Technology","date":{"$date":"2025-05-03T08:43:16.311Z"},"author":"Div","excerpt":"Google CEO Sundar Pichai confirmed under oath that Gemini, Google's AI chatbot, is\nexpected to be integrated into Siri by mid-2025. Discussions with Apple CEO Tim Cook\nincluded Gemini app distribution, with Cook indicating more third-party AI models would\nbe incorporated into Apple Intelligence later this year.","isBreaking":false,"__v":0,"image":"https://static.toiimg.com/thumb/msid-120772425,imgsize-24900,width-400,resizemode-4/Google-CEO-Sundar-Pichai.jpg"}
{"_id":{"$oid":"682c27806cdcfef42e8cef0c"},"title":"Draft Article","content":"Draft content","category":"News","date":{"$date":"2025-05-20T06:56:00.836Z"},"author":"Anonymous","excerpt":"Draft excerpt","isBreaking":false,"__v":0}
{"_id":{"$oid":"6815d5e663590134be674c27"},"title":"GTA 6 release date finally revealed! Rockstar confirms May 2026 launch","content":"Rockstar Games announced the official release date as May 26, 2026, in a public\nstatement released on May 2, 2025. This announcement confirmed what many\nhad suspected—that the previously anticipated 2025 window would not be met.\nThe company emphasized that the delay was necessary to uphold the quality an\ndepth that fans expect from the franchise.\n\"We are very sorry that this is later than you expected,\" Rockstar stated.\n\"The interest and excitement surrounding a new Grand Theft Auto has\nbeen truly humbling for our entire team. We want to thank you for your\nsupport and patience as we work to finish the game.\"\nThe studio added that the additional time will allow developers to \"deliver at the\nlevel of quality you expect and deserve,\" suggesting that final touches,\noptimizations, and polishing are ongoing.\nGTA 6 delay explained: Rockstar aims for bigger, better, bolder","category":"Business","date":{"$date":"2025-05-03T08:37:58.886Z"},"author":"Div","excerpt":"Rockstar Games has officially announced that Grand Theft Auto VI will be released on\nMay 26, 2026, pushing back the initial 2025 expectation. The delay is attributed to the\nstudio's commitment to upholding quality standards and meeting high expectations. The\ngame will feature a modern Vice City setting, dual protagonists, and is expected to launch\non next-gen consoles and PC.","isBreaking":false,"__v":0,"image":"https://static.toiimg.com/thumb/msid-120832553,imgsize-16782,width-400,resizemode-4/GTA-6-release-date-delayed.jpg"}
{"_id":{"$oid":"6815db4663590134be674cd0"},"title":"Ads, album art and more: 5 simple ways to use GPT-40-powered ChatGPT image generation tool","content":"dfhkfa","category":"Technology","date":{"$date":"2025-05-03T09:00:54.9Z"},"author":"Div","excerpt":"hek","isBreaking":false,"__v":0}
{"_id":{"$oid":"682ecb2457890da1e499d8ca"},"title":"Good morning","content":"Wo hoo!","category":"Business","date":{"$date":"2025-05-22T06:58:44.334Z"},"author":"Divy","excerpt":"Its time to celebrate","isBreaking":false,"__v":0,"image":"https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fstatic.vecteezy.com%2Fsystem%2Fresources%2Fpreviews%2F024%2F791%2F094%2Foriginal%2Fteam-of-corporate-people-celebration-happy-office-workers-celebrate-win-golden-cup-teamwork-trophy-and-success-persons-flat-illustration-vector.jpg&f=1&nofb=1&ipt=b0c822ed341583060bd10d959b7ed460b2012769fcfb7d21bb0463c1f72b0e31"}
{"_id":{"$oid":"682fffdeb1fd23e3c72ad053"},"title":"Chotu khush hai na tum?","content":"Kar raha hai website kaam","category":"World","date":{"$date":"2025-05-23T04:55:58.496Z"},"author":"Tera Bhai","excerpt":"Kya chotu khush ho gaya na ??","isBreaking":true,"__v":0,"image":"https://instagram.fbbi6-1.fna.fbcdn.net/v/t51.2885-19/485583363_1481315066183147_2612725894833101398_n.jpg?stp=dst-jpg_s320x320_tt6&_nc_ht=instagram.fbbi6-1.fna.fbcdn.net&_nc_cat=111&_nc_oc=Q6cZ2QFVzB-L54z9QbeYw_B1QtwSZnVmgYf4nH2DZz8nJLLqifVGRJO3tHuVLAuywFy918A&_nc_ohc=KydNvhE_hQEQ7kNvwG2Nw-w&_nc_gid=KRg2wSQHnLUVv2yWRhCQeQ&edm=AOQ1c0wBAAAA&ccb=7-5&oh=00_AfLZ4juYOKBfznaHOY7idqbO4TZaaEXwrlKTCoArYgi0jw&oe=6835D180&_nc_sid=8b3546"}
